Numpy features low-level binary data loading and storage
Numpy supports memory-mapped array

Input and output with pandas:
1. reading text files and other on-disk formates
2. loading data from databases
3. interacting with network sources like web APIs

In [1]:
pwd

'C:\\Users\\yuqia\\pydata-book'

In [2]:
cd examples

C:\Users\yuqia\pydata-book\examples

Reading and Writing data in text format

In [12]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [9]:
import pandas as pd
df = pd.read_csv('ex1.csv')

In [10]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
!type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [14]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [15]:
pd.read_csv('ex2.csv', names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
names=['a','b','c','d','message']

In [17]:
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [18]:
!type csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [19]:
parsed = pd.read_csv('csv_mindex.csv', index_col = ['key1','key2'])

In [20]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [21]:
!type ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [22]:
list(open('ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [23]:
result = pd.read_table('ex3.txt', sep='\s+')

In [24]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [25]:
!type ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [26]:
pd.read_csv('ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [27]:
!type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [28]:
result = pd.read_csv('ex5.csv')

In [29]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [31]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [33]:
sentinels = {'message':['foo','NA'], 'something':['two']}

In [35]:
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

Reading text files in pieces

In [36]:
result = pd.read_csv('ex6.csv')

In [37]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [38]:
pd.read_csv('ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [39]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)

In [40]:
chunker

In [50]:
from pandas import Series, DataFrame
chunker = pd.read_csv('ex6.csv', chunksize=1000)
tot = Series([])
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(), fill_value=0)
    
tot=tot.sort_values(ascending=False)

<ipython-input-50-7a2834d6d852>:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = Series([])

In [51]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

Writing data out to text format

In [52]:
data = pd.read_csv('ex5.csv')

In [53]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [54]:
data.to_csv('out.csv')

In [55]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [57]:
data.to_csv(sep='|')

'|something|a|b|c|d|message\r\n0|one|1|2|3.0|4|\r\n1|two|5|6||8|world\r\n2|three|9|10|11.0|12|foo\r\n'

In [58]:
data.to_csv(na_rep='NULL')

',something,a,b,c,d,message\r\n0,one,1,2,3.0,4,NULL\r\n1,two,5,6,NULL,8,world\r\n2,three,9,10,11.0,12,foo\r\n'

In [59]:
data.to_csv(index=False, header=False)

'one,1,2,3.0,4,\r\ntwo,5,6,,8,world\r\nthree,9,10,11.0,12,foo\r\n'

In [61]:
data.to_csv(index=False, columns=['a','b','c'])

'a,b,c\r\n1,2,3.0\r\n5,6,\r\n9,10,11.0\r\n'

In [63]:
import numpy as np
dates = pd.date_range('1/1/2000', periods=7)
ts = Series(np.arange(7), index=dates)
ts.to_csv('tseries.csv')

In [64]:
!type tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

Manually working with delimited formats

In [66]:
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [67]:
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3","4"

In [68]:
import csv
f = open('ex7.csv')

In [69]:
reader = csv.reader(f)

In [71]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [72]:
lines = list(csv.reader(open('ex7.csv')))
header, values = lines[0], lines[1:]
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [77]:
#Defining a new format can be done by defining a simple class
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

reader = csv.reader(open('ex7.csv'), dialect = my_dialect)

In [78]:
reader

In [79]:
# with statement is used to handle files more cleanly
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one','two','three'))

In [80]:
!type mydata.csv

one;two;three

JSON Data

In [88]:
obj = """
{"name": "Wes",
"places_lived": ["United States","Spain","Germany"],
"pet":null,
"siblings":[{"name":"Scott","age":25,"et":"Zuko"},
            {"name":"Katie","age":33,"pet":"Cisco"}]
}
"""

In [89]:
# JavaScript Object Notation
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 25, 'et': 'Zuko'},
  {'name': 'Katie', 'age': 33, 'pet': 'Cisco'}]}

In [91]:
asjson = json.dumps(result)

In [92]:
siblings = DataFrame(result['siblings'], columns=['name','age'])
siblings

    name  age
0  Scott   25
1  Katie   33

XML and HTML: Web Scraping

In [135]:
from lxml.html import parse
from urllib.request import urlopen
parsed = parse(urlopen('https://finance.yahoo.com/quote/AAPL/options?ltr=1'))
doc = parsed.getroot()

In [125]:
links = doc.findall('.//a')
links[15:20]

[<Element a at 0x13a1d1d2f40>,
 <Element a at 0x13a1d1d2ef0>,
 <Element a at 0x13a1d1d2e50>,
 <Element a at 0x13a1d1d2ea0>,
 <Element a at 0x13a1d1d2f90>]

In [126]:
lnk = links[15]
lnk.get('href')

'/portfolios'

In [127]:
lnk.text_content()

'My Portfolio'

In [128]:
urls = [lnk.get('href') for lnk in doc.findall('.//a')]

In [129]:
urls[-10:]

['https://help.yahoo.com/kb/finance-for-web',
 'https://yahoo.uservoice.com/forums/382977',
 'https://guce.yahoo.com/privacy-dashboard?locale=en-US',
 'https://policies.oath.com/us/en/oath/privacy/index.html',
 'https://policies.oath.com/us/en/oath/privacy/adinfo/index.html',
 'https://www.verizonmedia.com/policies/us/en/verizonmedia/terms/otos/index.html',
 'https://finance.yahoo.com/sitemap/',
 'https://twitter.com/YahooFinance',
 'https://facebook.com/yahoofinance',
 'https://www.linkedin.com/company/yahoo-finance']

In [136]:
tables = doc.findall('.//table')
calls = tables[0]
rows = calls.findall('.//tr')

In [137]:
def _unpack(row, kind='td'):
    elts = row.findall('.//%s' % kind)
    return [val.text_content() for val in elts]

_unpack(rows[0], kind='th')

['Contract Name',
 'Last Trade Date',
 'Strike',
 'Last Price',
 'Bid',
 'Ask',
 'Change',
 '% Change',
 'Volume',
 'Open Interest',
 'Implied Volatility']

In [138]:
_unpack(rows[1], kind='td')

['AAPL210319C00030000',
 '2021-03-12 4:24PM EDT',
 '30.00',
 '90.85',
 '92.90',
 '93.00',
 '0.00',
 '-',
 '1',
 '865',
 '655.08%']

In [143]:
from pandas.io.parsers import TextParser

def parse_options_data(table):
    rows = table.findall('.//tr')
    header = _unpack(rows[0], kind='th')
    print(header)
    data = [_unpack(r) for r in rows[1:]]
    return TextParser(data, name=header).get_chunk()

call_data = parse_options_data(calls)
call_data

['Contract Name', 'Last Trade Date', 'Strike', 'Last Price', 'Bid', 'Ask', 'Change', '% Change', 'Volume', 'Open Interest', 'Implied Volatility']

,AAPL210319C00030000,2021-03-12 4:24PM EDT,30.00,90.85,92.90,93.00,0.00,-,1,865,655.08%
0,AAPL210319C00035000,2021-02-26 12:16PM EDT,35.00,88.25,87.90,88.05,0.00,-,1,8,590.63%
1,AAPL210319C00040000,2021-02-24 11:32AM EDT,40.00,84.16,82.90,83.05,0.00,-,4,1,531.06%
2,AAPL210319C00045000,2021-03-08 11:07AM EDT,45.00,73.89,77.90,78.15,0.00,-,20,20,486.33%
3,AAPL210319C00047500,2021-03-05 4:56PM EDT,47.50,74.10,75.40,75.50,0.00,-,1,25,451.76%
4,AAPL210319C00048750,2021-03-04 11:03AM EDT,48.75,72.31,74.15,74.25,0.00,-,3,22,440.43%
...,...,...,...,...,...,...,...,...,...,...,...
161,AAPL210319C00720000,2020-08-28 2:27PM EDT,720.00,13.70,13.15,13.75,-1.05,-7.12%,12,101,"1,115.58%"
162,AAPL210319C00740000,2020-08-28 2:50PM EDT,740.00,12.35,11.80,12.40,-0.42,-3.29%,9,288,"1,094.39%"
163,AAPL210319C00800000,2020-08-28 3:54PM EDT,800.00,9.05,8.85,9.40,-0.75,-7.65%,50,-,"1,047.36%"
164,AAPL210319C00900000,2020-08-28 11:15AM EDT,900.00,6.80,6.15,6.65,-0.07,-1.02%,3,-,"1,007.28%"
165,AAPL210319C01000000,2020-08-28 3:41PM EDT,"1,000.00",5.00,4.85,5.15,-0.25,-4.76%,187,614,992.68%

*using lxml and beautifulSoup requires a familiarity of the tree structure of marksups

*Textbook examples are a bit outdated
https://towardsdatascience.com/xml-scraping-done-right-6ac66eef9efc
https://docs.python-guide.org/scenarios/scrape/
https://tgmstat.wordpress.com/2013/09/04/xml-web-scraping/#:~:text=XML%20stands%20for%20Extensible%20Markup,independent%20way%20of%20storing%20data.

*Using beautifulsoup to automatically scrape from multiple pages

https://towardsdatascience.com/using-beautifulsoup-on-wikipedia-dd0c620d5861

https://towardsdatascience.com/scraping-from-all-over-wikipedia-4aecadcedf11

Reading Microsoft Excel Files

*use ExcelFile in the namespaces

Interacting with HTML and web APIs

In [158]:
#searching for tweets with python: https://towardsdatascience.com/searching-for-tweets-with-python-f659144b225f
#github: Twitter-API-v2-sample-code
#AAAAAAAAAAAAAAAAAAAAAFa1NgEAAAAA2jsVsx832xr8GQNfY8PPJ0tTwQE%3DqKKKuNMQg3kN5soCWWwGzf7eRuARHx257yssDAhQyQmwvbum8T

In [155]:
import requests
import json
#its bad practice to place your bearer token directly into the script (this is just done for illustration purposes)
BEARER_TOKEN = "AAAAAAAAAAAAAAAAAAAAAFa1NgEAAAAA2jsVsx832xr8GQNfY8PPJ0tTwQE%3DqKKKuNMQg3kN5soCWWwGzf7eRuARHx257yssDAhQyQmwvbum8T"
#define search twitter function
def search_twitter(query, tweet_fields, bearer_token = BEARER_TOKEN):
    headers = {"Authorization": "Bearer {}".format(bearer_token)}

    url = "https://api.twitter.com/2/tweets/search/recent?query={}&{}".format(
        query, tweet_fields
    )
    response = requests.request("GET", url, headers=headers)

    print(response.status_code)

    if response.status_code != 200:
        raise Exception(response.status_code, response.text)
    return response.json()

In [156]:
#search term
query = "skateboarding dog"
#twitter fields to be returned by api call
tweet_fields = "tweet.fields=text,author_id,created_at"

#twitter api call
json_response = search_twitter(query=query, tweet_fields=tweet_fields, bearer_token=BEARER_TOKEN)
#pretty printing
print(json.dumps(json_response, indent=4, sort_keys=True))

200
{
    "data": [
        {
            "author_id": "962620310150299648",
            "created_at": "2021-03-15T16:31:01.000Z",
            "id": "1371499186592485376",
            "text": "RT @TomthunkitsMind: If you\u2019ve already seen a dog skateboarding in overalls today just keep on scrolling...\nvia RecChapman \nhttps://t.co/PB\u2026"
        },
        {
            "author_id": "16123646",
            "created_at": "2021-03-15T16:28:09.000Z",
            "id": "1371498462764806145",
            "text": "RT @TomthunkitsMind: If you\u2019ve already seen a dog skateboarding in overalls today just keep on scrolling...\nvia RecChapman \nhttps://t.co/PB\u2026"
        },
        {
            "author_id": "2925084143",
            "created_at": "2021-03-15T16:01:02.000Z",
            "id": "1371491637201940488",
            "text": "RT @TomthunkitsMind: If you\u2019ve already seen a dog skateboarding in overalls today just keep on scrolling...\nvia RecChapman \nhttps://t.co/PB\u2026"
        },
        {
            "author_id": "256049693",
            "created_at": "2021-03-15T15:51:25.000Z",
            "id": "1371489218669711361",
            "text": "RT @deanotheyido123: Well, isn\u2019t Twitter a total delight today? If it isn\u2019t the football (Spurs) then it\u2019s everyone in the world hates wome\u2026"
        },
        {
            "author_id": "752654342650335232",
            "created_at": "2021-03-15T15:50:21.000Z",
            "id": "1371488951039574027",
            "text": "RT @TomthunkitsMind: If you\u2019ve already seen a dog skateboarding in overalls today just keep on scrolling...\nvia RecChapman \nhttps://t.co/PB\u2026"
        },
        {
            "author_id": "551038877",
            "created_at": "2021-03-15T15:10:30.000Z",
            "id": "1371478922915811333",
            "text": "RT @TomthunkitsMind: If you\u2019ve already seen a dog skateboarding in overalls today just keep on scrolling...\nvia RecChapman \nhttps://t.co/PB\u2026"
        },
        {
            "author_id": "948012715670355968",
            "created_at": "2021-03-15T15:10:15.000Z",
            "id": "1371478859648962561",
            "text": "RT @TomthunkitsMind: If you\u2019ve already seen a dog skateboarding in overalls today just keep on scrolling...\nvia RecChapman \nhttps://t.co/PB\u2026"
        },
        {
            "author_id": "289118612",
            "created_at": "2021-03-15T15:09:15.000Z",
            "id": "1371478609467215879",
            "text": "If you\u2019ve already seen a dog skateboarding in overalls today just keep on scrolling...\nvia RecChapman \nhttps://t.co/PB85HFgMsp 01"
        },
        {
            "author_id": "750366213419601920",
            "created_at": "2021-03-15T12:19:47.000Z",
            "id": "1371435959061975040",
            "text": "RT @TomthunkitsMind: If you\u2019ve already seen a dog skateboarding in overalls today just keep on scrolling...\nvia RecChapman \nhttps://t.co/PB\u2026"
        },
        {
            "author_id": "1370678278533570560",
            "created_at": "2021-03-15T12:18:20.000Z",
            "id": "1371435596707676162",
            "text": "RT @TomthunkitsMind: If you\u2019ve already seen a dog skateboarding in overalls today just keep on scrolling...\nvia RecChapman \nhttps://t.co/PB\u2026"
        }
    ],
    "meta": {
        "newest_id": "1371499186592485376",
        "next_token": "b26v89c19zqg8o3fosqrfnma2ab22echb32unmbvmehkt",
        "oldest_id": "1371435596707676162",
        "result_count": 10
    }
}

Interacting with Databases

In [160]:
import sqlite3

query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20), 
c REAL, d INTEGER);
"""

con = sqlite3.connect(':memory:')
con.execute(query)
con.commit()

In [161]:
data = [('Atlanta','Georgia', 1.25, 6),
       ('Tallahassee','Florida', 2.6, 3),
       ('Sacramento','California', 1.7, 5)]

stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

con.executemany(stmt, data)
con.commit()

In [162]:
#most Py SQL drivers return a list of tuples when selecting from a table
cursor = con.execute('select * from test')

rows = cursor.fetchall()

rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [181]:
print(list(zip(*cursor.description)))

[('a', 'b', 'c', 'd'), (None, None, None, None), (None, None, None, None), (None, None, None, None), (None, None, None, None), (None, None, None, None), (None, None, None, None)]

In [182]:
DataFrame(rows, columns=list(zip(*cursor.description))[0])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [184]:
import pandas.io.sql as sql
sql.read_sql('select * from test', con)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5